garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1713.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G4D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC4CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC4CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC4MODE" edc:desc="" edc:mask="0x7" edc:name="LC4MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC4INTN" edc:desc="" edc:mask="0x1" edc:name="LC4INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4INTP" edc:desc="" edc:mask="0x1" edc:name="LC4INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4OUT" edc:desc="" edc:mask="0x1" edc:name="LC4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC4EN" edc:desc="" edc:mask="0x1" edc:name="LC4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4MODE0" edc:desc="" edc:mask="0x1" edc:name="LC4MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4MODE1" edc:desc="" edc:mask="0x1" edc:name="LC4MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4MODE2" edc:desc="" edc:mask="0x1" edc:name="LC4MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC4POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC4POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC4G1POL" edc:desc="" edc:mask="0x1" edc:name="LC4G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G2POL" edc:desc="" edc:mask="0x1" edc:name="LC4G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G3POL" edc:desc="" edc:mask="0x1" edc:name="LC4G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4G4POL" edc:desc="" edc:mask="0x1" edc:name="LC4G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC4POL" edc:desc="" edc:mask="0x1" edc:name="LC4POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC4SEL0" edc:desc="Input select register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC4SEL0" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF30">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D1S0" edc:desc="" edc:mask="0x1" edc:name="LC4D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S1" edc:desc="" edc:mask="0x1" edc:name="LC4D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S2" edc:desc="" edc:mask="0x1" edc:name="LC4D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S3" edc:desc="" edc:mask="0x1" edc:name="LC4D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D1S4" edc:desc="" edc:mask="0x1" edc:name="LC4D1S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC4D1S" edc:desc="" edc:mask="0x1f" edc:name="LC4D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0x1f" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC4SEL1" edc:desc="Input select register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC4SEL1" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF31">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D2S0" edc:desc="" edc:mask="0x1" edc:name="LC4D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S1" edc:desc="" edc:mask="0x1" edc:name="LC4D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S2" edc:desc="" edc:mask="0x1" edc:name="LC4D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S3" edc:desc="" edc:mask="0x1" edc:name="LC4D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D2S4" edc:desc="" edc:mask="0x1" edc:name="LC4D2S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC4D2S" edc:desc="" edc:mask="0x1f" edc:name="LC4D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0x1f" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D2S0" edc:desc="" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:desc="" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:desc="" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:desc="" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:desc="" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC4SEL2" edc:desc="Input select register 2" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC4SEL2" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF32">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC4D3S0" edc:desc="" edc:mask="0x1" edc:name="LC4D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S1" edc:desc="" edc:mask="0x1" edc:name="LC4D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S2" edc:desc="" edc:mask="0x1" edc:name="LC4D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S3" edc:desc="" edc:mask="0x1" edc:name="LC4D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4D3S4" edc:desc="" edc:mask="0x1" edc:name="LC4D3S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC4D3S" edc:desc="" edc:mask="0x1f" edc:name="LC4D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0x1f" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D3S0" edc:desc="" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:desc="" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:desc="" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:desc="" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:desc="" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
